class arena:
    AUTH_KEY = "YOUR_KEY"

horse_pool = {
    "MIX": {
        "number": [ "01", "02", "03", "04" ],
        "_comment": "other_player填未实装角色",
        "player": [
            "杏奈","真步","璃乃","初音","霞","伊绪",
            "咲恋","望","妮诺","秋乃","镜华","智","真琴",
            "伊莉亚","纯","静流","莫妮卡","流夏","吉塔",
            "亚里莎","安","古蕾娅", "空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜", "流夏(夏日)",
            "伊莉亚(圣诞节)", "优妮", "琪爱儿", "霞(魔法少女)", "杏奈(夏日)",
            "リン(レンジャー)", "マヒル(レンジャー)", "璃乃(奇境)", "祈梨",
            "贪吃佩可(公主)", "优衣(公主)", "可可萝(公主)", "茉莉", "茜里", "宫子", "雪",
            "七七香", "美里", "铃奈", "香织", "美美", "绫音", "铃", "惠理子",
            "忍", "真阳", "栞", "千歌", "空花", "珠希", "美冬", "深月","纺希",
            "日和", "怜", "禊", "胡桃", "依里", "铃莓", "优花梨", "碧", "美咲",
            "莉玛", "步未"
        ],
        "other_player": [   ]
    },
    "TW": {
        "number": [ "01", "02", "03", "04" ],
        "_comment": "other_player填未实装角色",
        "player": [
            "杏奈","真步","璃乃","初音","霞","伊绪",
            "咲恋","望","妮诺","秋乃","镜华","智","真琴",
            "伊莉亚","纯","静流","莫妮卡","流夏","吉塔",
            "亚里莎","安","古蕾娅", "空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜", "优妮",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "贪吃佩可(公主)",
            "茉莉","茜里","宫子","雪","七七香","美里",
            "铃奈","香织","美美","绫音","铃","惠理子",
            "忍","真阳","栞","千歌","空花","珠希","美冬",
            "深月","纺希", "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛","步未"
        ],
        "other_player": [ "琪爱儿", "リン(レンジャー)", "マヒル(レンジャー)", "璃乃(奇境)", "祈梨"]
    },
    "JP": {
        "number": [ "01", "02", "03", "04" ],
        "_comment": "other_player填未实装角色",
        "player": [
            "杏奈","真步","璃乃","初音","霞","伊绪",
            "咲恋","望","妮诺","秋乃","镜华","智","真琴",
            "伊莉亚","纯","静流","莫妮卡","流夏","吉塔",
            "亚里莎","安","古蕾娅", "空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜", "流夏(夏日)",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "优妮", "琪爱儿", "杏奈(夏日)",
            "リン(レンジャー)", "マヒル(レンジャー)", "璃乃(奇境)", "祈梨", "贪吃佩可(公主)",
            "优衣(公主)", "可可萝(公主)", "茉莉","茜里","宫子","雪","七七香","美里",
            "铃奈","香织","美美","绫音","铃","惠理子",
            "忍","真阳","栞","千歌","空花","珠希","美冬",
            "深月","纺希", "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛","步未"
        ],
        "other_player": [  ]
    },
    "BL": {
        "number": [ "01", "02", "03", "04" ],
        "_comment": "other_player填未实装角色",
        "player": [
            "杏奈","璃乃","真步","伊绪",
            "望","妮诺","秋乃", "亚里莎",
            "静流","莫妮卡","吉塔", "纯",
            "镜华","咲恋","真琴", "初音",
            "伊莉亚", "茉莉","茜里","宫子","雪","铃","美里",
            "铃奈","香织","美美","绫音","惠理子",
            "真阳","栞","千歌","空花","珠希","美冬",
            "深月","忍", "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛"
        ],
        "other_player": [
            "霞", "智", "流夏", "安", "古蕾娅","空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "优妮", "琪爱儿"
        ]
    }
}

gacha_pool ={
    "MIX": {
        "up_prob":  14,
        "s3_prob":  50,
        "s2_prob": 180,
        "up": [ "真阳(游侠)", "拉比林斯达" ],
        "_comment": "star3 仅填3星常驻角色。不要填UP角，否则出率会偏高",
        "star3": [
            "杏奈","真步","璃乃","初音","霞","伊绪",
            "咲恋","望","妮诺","秋乃","镜华","智","真琴",
            "伊莉亚","纯","静流","莫妮卡","流夏","吉塔",
            "亚里莎","安","古蕾娅", "空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "优妮", "琪爱儿",
            "リン(レンジャー)", "マヒル(レンジャー)", "璃乃(奇境)", "祈梨"
        ],
        "other_normal_star3": [  ],
        "star2": [
            "茉莉","茜里","宫子","雪","七七香","美里",
            "铃奈","香织","美美","绫音","铃","惠理子",
            "忍","真阳","栞","千歌","空花","珠希","美冬",
            "深月","纺希"
        ],
        "star1" : [
            "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛","步未"
        ]
    },
    "TW": {
        "up_prob":   7,
	    "s3_prob":  25,
        "s2_prob": 180,
        "up": [ "真阳(游侠)" ],
        "_comment": "star3 仅填3星常驻角色。不要填UP角，否则出率会偏高",
        "star3": [
            "杏奈","真步","璃乃","初音","霞","伊绪",
            "咲恋","望","妮诺","秋乃","镜华","智","真琴",
            "伊莉亚","纯","静流","莫妮卡","流夏","吉塔",
            "亚里莎","安","古蕾娅", "空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "优妮", "琪爱儿"
        ],
        "other_normal_star3": [ "リン(レンジャー)", "マヒル(レンジャー)", "璃乃(奇境)", "祈梨"],
        "star2": [
            "茉莉","茜里","宫子","雪","七七香","美里",
            "铃奈","香织","美美","绫音","铃","惠理子",
            "忍","真阳","栞","千歌","空花","珠希","美冬",
            "深月","纺希"
        ],
        "star1" : [
            "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛","步未"
        ]
    },
    "JP": {
        "up_prob":   7,
        "s3_prob":  25,
        "s2_prob": 180,
        "up": [ "拉比林斯达" ],
        "_comment": "star3 仅填3星常驻角色。不要填UP角，否则出率会偏高",
        "star3": [
            "杏奈","真步","璃乃","初音","霞","伊绪",
            "咲恋","望","妮诺","秋乃","镜华","智","真琴",
            "伊莉亚","纯","静流","莫妮卡","流夏","吉塔",
            "亚里莎","安","古蕾娅", "空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "优妮", "琪爱儿",
            "リン(レンジャー)", "マヒル(レンジャー)", "璃乃(奇境)", "祈梨",
            "七七香(夏日)"
        ],
        "other_normal_star3": [  ],
        "star2": [
            "茉莉","茜里","宫子","雪","七七香","美里",
            "铃奈","香织","美美","绫音","铃","惠理子",
            "忍","真阳","栞","千歌","空花","珠希","美冬",
            "深月","纺希"
        ],
        "star1" : [
            "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛","步未"
        ]
    },
    "BL": {
        "up_prob":   7,
        "s3_prob":  25,
        "s2_prob": 180,
        "up": [ "凯留(夏日)" ],
        "_comment": "star3 仅填3星常驻角色。不要填UP角，否则出率会偏高",
        "star3": [
            "杏奈","璃乃","初音","伊绪",
            "望","妮诺","秋乃", "亚里莎",
            "静流","莫妮卡","吉塔", "纯", "镜华",
            "伊莉亚", "真步", "咲恋", "真琴"
        ],
        "other_normal_star3": [
            "霞", "智", "纯", "流夏", "安", "古蕾娅","空花(大江户)", "妮诺(大江户)",
            "克萝依", "碧(插班生)", "美美(万圣节)", "露娜",
            "伊莉亚(圣诞节)", "霞(魔法少女)", "优妮", "琪爱儿"
        ],
        "star2": [
            "茜里","宫子","雪","铃",
            "铃奈","香织","美美","绫音","惠理子",
            "真阳","栞","千歌","空花","珠希","美冬",
            "深月", "美里", "纺希", "忍"
        ],
        "star1" : [
            "日和","怜","禊","胡桃","依里","铃莓",
            "优花梨","碧","美咲","莉玛"
        ]
    }
}

luck_type = [
    {
        "good-luck": 10,
        "name": "大吉"
    },
    {
        "good-luck": 9,
        "name": "中吉"
    },
    {
        "good-luck": 8,
        "name": "小吉"
    },
    {
        "good-luck": 7,
        "name": "吉"
    },
    {
        "good-luck": 6,
        "name": "半吉"
    },
    {
        "good-luck": 5,
        "name": "末吉"
    },
    {
        "good-luck": 4,
        "name": "末小吉"
    },
    {
        "good-luck": -6,
        "name": "凶"
    },
    {
        "good-luck": -7,
        "name": "小凶"
    },
    {
        "good-luck": -8,
        "name": "半凶"
    },
    {
        "good-luck": -9,
        "name": "末凶"
    },
    {
        "good-luck": -10,
        "name": "大凶"
    },
    {
        "good-luck": 20,
        "name": "総合運"
    },
    {
        "good-luck": 21,
        "name": "恋愛運"
    },
    {
        "good-luck": 22,
        "name": "結婚運"
    },
    {
        "good-luck": 23,
        "name": "仕事運"
    },
    {
        "good-luck": 24,
        "name": "金運"
    },
    {
        "good-luck": 25,
        "name": "勉強運" 
    },
    {
        "good-luck": 26,
        "name": "全体運"
    },
    {
        "good-luck": 27,
        "name": "関係運"
    }
]
luck_desc = [
    {
        "charaid": ["1", "2"],
        "_name": "凯露",
        "type": [
            {
                "good-luck": 10,
                "content": "仅限今天而已！别想多了！！"
            },
            {
                "good-luck": 8,
                "content": "宜抽卡﹁十连五彩不是梦﹂"
            },
            {
                "good-luck": 7,
                "content": "宜刷本﹁碎片装备一大堆！你是托吧﹂"
            },
            {
                "good-luck": 6,
                "content": "还不学习吗，殺すわよっ！"
            },
            {
                "good-luck": -6,
                "content": "忌抽卡﹁这个池子不行的，没有3x啊﹂"
            },
            {
                "good-luck": -9,
                "content": "ヤバイわよ！钱包又没了"
            },
            {
                "good-luck": 5,
                "content": "双场排名飞升"
            },
            {
                "good-luck": -7,
                "content": "伊莉亚又暴击了︵对自己"
            },
            {
                "good-luck": -8,
                "content": "害学习呢，你被梯了"
            },
            {
                "good-luck": -10,
                "content": "遇到困难，睡大觉"
            },
            {
                "good-luck": 24,
                "content": "金运不错，所以你能借钱给我吗？"
            }
        ]
    },
    {
        "charaid": ["3", "4"],
        "_name": "初音",
        "type": [
            {
                "good-luck": 10,
                "content": "Kira☆今天运气绝佳♫"
            },
            {
                "good-luck": 9,
                "content": "睡个午觉可以变清爽一点☆"
            },
            {
                "good-luck": 4,
                "content": "醒醒你体力满了！"
            },
            {
                "good-luck": -6,
                "content": "梦到熬夜赶ddl"
            },
            {
                "good-luck": -9,
                "content": "用超能力的话，运气会不会好一点呢"
            },
            {
                "good-luck": 20,
                "content": "ハツネちゃんの应援だよ！一切都会好起来的"
            },
            {
                "good-luck": 25,
                "content": "叫上栞栞一起学习吧"
            }
        ]
    },
    {
        "charaid": ["5", "6"],
        "_name": "杏奈",
        "type": [
            {
                "good-luck": 8,
                "content": "氷狂凍獄絶零破！︵宜JJC"
            },
            {
                "good-luck": 7,
                "content": "我ら煉獄に舞いし一陣の疾風︵宜现充"
            },
            {
                "good-luck": 4,
                "content": "就到此为止了吗…︵宜摸鱼"
            },
            {
                "good-luck": -6,
                "content": "冥 空 天 升︵会被演"
            },
            {
                "good-luck": -8,
                "content": "会被提起黑历史"
            },
            {
                "good-luck": 21,
                "content": "邪王真眼、我会追上你的︵宜表白"
            }
        ]
    },
    {
        "charaid": ["7", "8"],
        "_name": "优妮",
        "type": [
            {
                "good-luck": 7,
                "content": "宜学习﹁今天去图书馆自习吗﹂"
            },
            {
                "good-luck": 5,
                "content": "宜击剑﹁讨论人性与哲学光辉﹂"
            },
            {
                "good-luck": 4,
                "content": "论文的事，需要帮忙吗"
            },
            {
                "good-luck": -6,
                "content": "会思考怎么拆对手到超时"
            },
            {
                "good-luck": -7,
                "content": "会忘记每日十连"
            },
            {
                "good-luck": -9,
                "content": "忌表白﹁啊啊，浓咖啡真好喝﹂"
            },
            {
                "good-luck": 26,
                "content": "見たまえ同志！これこそわ﹁ユニちゃんズ﹂！"
            }
        ]
    },
    {
        "charaid": ["9", "10"],
        "_name": "琪爱儿",
        "type": [
            {
                "good-luck": 9,
                "content": "切噜☆♪"
            },
            {
                "good-luck": 6,
                "content": "宜水群﹁你就是龙王切噜♪﹂"
            },
            {
                "good-luck": 4,
                "content": "末小吉就是说你今天也没什么运气切噜噜"
            },
            {
                "good-luck": -6,
                "content": "忌装弱﹁因为先辈你本来就很弱切噜♪﹂"
            },
            {
                "good-luck": -9,
                "content": "切噜噜噜噜♪困难本0碎切噜！"
            },
            {
                "good-luck": 27,
                "content": "总是萌混过关是交不到朋友的切噜☆"
            }
        ]
    },
    {
        "charaid": ["11", "12"],
        "_name": "克萝依",
        "type": [
            {
                "good-luck": 10,
                "content": "哦|偶尔也会有这样的日子呢，偶尔就是了"
            },
            {
                "good-luck": 6,
                "content": "JJC啊，没几个人打你的"
            },
            {
                "good-luck": 5,
                "content": "小心拖延症"
            },
            {
                "good-luck": -7,
                "content": "会跨服聊天"
            },
            {
                "good-luck": -8,
                "content": "水群会冷场"
            },
            {
                "good-luck": 23,
                "content": "工作总是遇到奇怪的人"
            }
        ]
    },
    {
        "charaid": ["13", "14"],
        "_name": "静流",
        "type": [
            {
                "good-luck": 9,
                "content": "会十连出碎片"
            },
            {
                "good-luck": 8,
                "content": "宜熬夜爆肝"
            },
            {
                "good-luck": 5,
                "content": "宜出刀﹁希望弟弟暴击﹂"
            },
            {
                "good-luck": -6,
                "content": "抽卡会+19"
            },
            {
                "good-luck": -8,
                "content": "没什么精神，要姐姐的头槌清醒下吗♡"
            },
            {
                "good-luck": 21,
                "content": "偷跑才是王道！︵冬马&静流"
            }
        ]
    },
    {
        "charaid": ["15", "16"],
        "_name": "惠理子",
        "type": [
            {
                "good-luck": 10,
                "content": "诸事皆宜"
            },
            {
                "good-luck": 7,
                "content": "宜现充﹁会遇到命 运 之 人﹂"
            },
            {
                "good-luck": -7,
                "content": "你就是记仇碎钻回刺人"
            },
            {
                "good-luck": -8,
                "content": "忌dd﹁别的女人就这么吸引你吗﹂"
            },
            {
                "good-luck": -10,
                "content": "今天……一直会在你身后的"
            },
            {
                "good-luck": 22,
                "content": "爱情也需要调味料︵电脑配件"
            }
        ]
    },
    {
        "charaid": ["17", "18"],
        "_name": "优花梨",
        "type": [
            {
                "good-luck": 8,
                "content": "宜社畜﹁你就是戒酒后的优花梨﹂"
            },
            {
                "good-luck": 7,
                "content": "宜摸鱼﹁我就再喝亿杯﹂"
            },
            {
                "good-luck": 4,
                "content": "宜追番﹁守护最好的二刺螈﹂"
            },
            {
                "good-luck": -7,
                "content": "忌现充﹁现充爆炸吧﹂"
            },
            {
                "good-luck": -8,
                "content": "優花梨，为什么不喝呢~♫"
            },
            {
                "good-luck": 20,
                "content": "运气用在了没用的地方"
            }
        ]
    },
    {
        "charaid": ["19", "20"],
        "_name": "空花",
        "type": [
            {
                "good-luck": 9,
                "content": "宜摸鱼﹁空花的妄想停不下来﹂"
            },
            {
                "good-luck": 7,
                "content": "宜瑟图﹁群涩批时不时来暴露xp﹂"
            },
            {
                "good-luck": -6,
                "content": "忌社畜﹁会被当成抖M﹂"
            },
            {
                "good-luck": -7,
                "content": "忌水群﹁会被放置PLAY﹂"
            },
            {
                "good-luck": -8,
                "content": "忌瑟图﹁哦淦老兄你xp好怪啊﹂"
            },
            {
                "good-luck": 26,
                "content": "摩多摩多摩多~"
            }
        ]
    },
    {
        "charaid": ["21", "22"],
        "_name": "忍",
        "type": [
            {
                "good-luck": 8,
                "content": "父亲说这个占卜一点都不准。。。"
            },
            {
                "good-luck": 6,
                "content": "宜DD﹁骷髅老爹也想栞栞！﹂"
            },
            {
                "good-luck": 4,
                "content": "宜对线﹁你就是送爸人﹂"
            },
            {
                "good-luck": -7,
                "content": "忌抽卡﹁父亲的占卜罢了，你身后是有挺多怨灵的﹂"
            },
            {
                "good-luck": -9,
                "content": "忌表白﹁会得骷髅老爹真传﹂"
            },
            {
                "good-luck": 20,
                "content": "今天你身边也是有各种各样的幽灵在呢"
            }
        ]
    },
    {
        "charaid": ["23", "24"],
        "_name": "真步",
        "type": [
            {
                "good-luck": 10,
                "content": "みらくるもほりん、くるりんぱ"
            },
            {
                "good-luck": 7,
                "content": "宜刷本﹁这个是真步真步N3魔法！﹂"
            },
            {
                "good-luck": 5,
                "content": "宜膜佬﹁？这真步河里﹂"
            },
            {
                "good-luck": -6,
                "content": "宜复读﹁真步真步教○脑开始﹂"
            },
            {
                "good-luck": -7,
                "content": "忌竞技场﹁那么，答案就只有一个了！﹂"
            },
            {
                "good-luck": 20,
                "content": "咕噜灵波~"
            }
        ]
    },
    {
        "charaid": ["25", "26"],
        "_name": "茜里",
        "type": [
            {
                "good-luck": 6,
                "content": "宜出游﹁诶诶要在外面吗﹂"
            },
            {
                "good-luck": 5,
                "content": "宜运动﹁这样的、太激烈了嗯﹂"
            },
            {
                "good-luck": 4,
                "content": "那里，已经满满的了︵指体力"
            },
            {
                "good-luck": -7,
                "content": "明明还是早上就要从后面。。。︵打回前排"
            },
            {
                "good-luck": -9,
                "content": "忌瑟图﹁是谁害想着开车呢爪巴﹂"
            },
            {
                "good-luck": 21,
                "content": "这种事，就是两个人一起会变舒服︵心情上︶的对吧？"
            }
        ]
    },
    {
        "charaid": ["27", "28"],
        "_name": "镜华",
        "type": [
            {
                "good-luck": 7,
                "content": "宜水群﹁今天你就是喷水龙王﹂"
            },
            {
                "good-luck": 5,
                "content": "宜社畜﹁就算很讨厌，今天我也努力吃了一片胡萝卜﹂"
            },
            {
                "good-luck": 6,
                "content": "宜出刀﹁虽然希望可以暴击変態桑而不是王﹂"
            },
            {
                "good-luck": -6,
                "content": "忌装弱﹁优妮就算了，你也想叫妈妈？﹂"
            },
            {
                "good-luck": 26,
                "content": "全体运会不会是能吃到纸杯蛋糕呢"
            },
            {
                "good-luck": 27,
                "content": "変態変態変態変態！"
            }
        ]
    },
    {
        "charaid": ["29", "30"],
        "_name": "美美",
        "type": [
            {
                "good-luck": 8,
                "content": "天兔霸断剑，要试试吗"
            },
            {
                "good-luck": 7,
                "content": "宜出游﹁会遇到小萝莉﹂"
            },
            {
                "good-luck": 4,
                "content": "宜刷本﹁お兄ちゃん見ていて、いっぱい箱！﹂"
            },
            {
                "good-luck": -7,
                "content": "忌出刀﹁美美的狮鹫长大了也会伤害它吗﹂"
            },
            {
                "good-luck": -8,
                "content": "这个月会战摸了"
            },
            {
                "good-luck": 27,
                "content": "镜华和未奏希也会吵架，但最后还是会和好的"
            }
        ]
    },
    {
        "charaid": ["31", "32"],
        "_name": "未奏希",
        "type": [
            {
                "good-luck": 8,
                "content": "宜刷本﹁成功避开攻略烟雾弹﹂"
            },
            {
                "good-luck": 5,
                "content": "宜摸鱼﹁每天三刀甜心刀，大家一起睡饱饱﹂"
            },
            {
                "good-luck": 5,
                "content": "小 心 熊 孩 子"
            },
            {
                "good-luck": -6,
                "content": "忌出刀﹁刚跟镜华吵完架，现在是0暴镜华﹂"
            },
            {
                "good-luck": -8,
                "content": "忌作死﹁自己挖的陷阱，自己踩下去﹂"
            },
            {
                "good-luck": 25,
                "content": "哎呀，学不会啊！"
            }
        ]
    },
    {
        "charaid": ["33", "34"],
        "_name": "怜",
        "type": [
            {
                "good-luck": 7,
                "content": "宜钓鱼﹁剑圣之意不在鱼，在乎：：﹂"
            },
            {
                "good-luck": 5,
                "content": "宜击剑﹁要刺得快！刺得狠！﹂"
            },
            {
                "good-luck": 4,
                "content": "宜现充﹁一起特训到晚上吧﹂"
            },
            {
                "good-luck": -8,
                "content": "今天你就是老醋坛︵士条怜︶了"
            },
            {
                "good-luck": -10,
                "content": "忌摸鱼﹁当你偷偷快乐的时候，优衣正在凝视着你﹂"
            },
            {
                "good-luck": 23,
                "content": "遇到困难的时候，男？朋友总会帮你︵雪乃&怜"
            }
        ]
    },
    {
        "charaid": ["35", "36"],
        "_name": "优衣",
        "type": [
            {
                "good-luck": 10,
                "content": "诸事皆宜！今、今后也请：：︵宕机"
            },
            {
                "good-luck": 6,
                "content": "宜现充﹁朋？友都会顾及关心你﹂"
            },
            {
                "good-luck": -6,
                "content": "说着对不起实际却偷吃的屑都不配被我奶"
            },
            {
                "good-luck": -7,
                "content": "忌表白﹁诶诶诶我怎么又被对不起了﹂"
            },
            {
                "good-luck": -10,
                "content": "忌抽卡﹁又井了呢，骑士君﹂"
            },
            {
                "good-luck": 21,
                "content": "不许说对不起！"
            }
        ]
    },
    {
        "charaid": ["37", "38"],
        "_name": "日和莉",
        "type": [
            {
                "good-luck": 9,
                "content": "宜竞技场﹁欧拉欧拉欧拉欧拉欧拉！﹂"
            },
            {
                "good-luck": 8,
                "content": "日行一善会有好事发生"
            },
            {
                "good-luck": 6,
                "content": "宜对线﹁那就对他使用炎拳吧﹂"
            },
            {
                "good-luck": -7,
                "content": "忌偏见﹁你以为我是猫，其实我是老虎哒﹂"
            },
            {
                "good-luck": -8,
                "content": "忌表白﹁游戏也好，相遇也好，明明是我先来的﹂"
            },
            {
                "good-luck": 27,
                "content": "开朗活泼想要保持他人关系，到底哪里出错了︵团子&日和莉"
            }
        ]
    },
    {
        "charaid": ["39", "40"],
        "_name": "贪吃佩可",
        "type": [
            {
                "good-luck": 10,
                "content": "んま～い！ごはんは命のエネルギー☆"
            },
            {
                "good-luck": 7,
                "content": "宜现充﹁おいっす～☆﹂"
            },
            {
                "good-luck": 5,
                "content": "宜二刺猿﹁真男人就该？高达﹂"
            },
            {
                "good-luck": -7,
                "content": "今日性能降低﹁因为好吃就是高兴嘛﹂"
            },
            {
                "good-luck": -10,
                "content": "忌水群﹁群霸瞳篡改群员记忆导致冷场﹂"
            },
            {
                "good-luck": 20,
                "content": "ヤバイですね‼"
            }
        ]
    },
    {
        "charaid": ["41", "42"],
        "_name": "可可萝",
        "type": [
            {
                "good-luck": 10,
                "content": "今天也做得很好、主さま"
            },
            {
                "good-luck": 9,
                "content": "宜抽卡﹁爱梅斯大人说今天又会遇到新的女生﹂"
            },
            {
                "good-luck": 8,
                "content": "宜刷本﹁已经让密涅瓦偷偷改过数据了﹂"
            },
            {
                "good-luck": -8,
                "content": "果然又是主人认识的女生，以后叫わんわんの主さま好了"
            },
            {
                "good-luck": -9,
                "content": "忌半途而废﹁第几次转生了，DD﹂"
            },
            {
                "good-luck": 26,
                "content": "诸事皆宜"
            }
        ]
    }
]

# 数据来自兰德索尔图书馆
total_mana = {1:0, 2:960, 3:1920, 4:2880, 5:3840, 6:4800, 7:5760, 8:6720, 9:7680, 10:8640, 11:9600, 12:11040, 13:12480, 14:13920, 15:15360, 16:17200, 17:19440, 18:22080, 19:25120, 20:28560, 21:32400, 22:36640, 23:41280, 24:46320, 25:51760, 26:57600, 27:63840, 28:70480, 29:77520, 30:84960, 31:92800, 32:101840, 33:112080, 34:123520, 35:136160, 36:150000, 37:165040, 38:184080, 39:207120, 40:234160, 41:265200, 42:300240, 43:339280, 44:382320, 45:429760, 46:481600, 47:537840, 48:598480, 49:663520, 50:732960, 51:806800, 52:885040, 53:967680, 54:1053560, 55:1142640, 56:1234920, 57:1330400, 58:1429080, 59:1530960, 60:1636040, 61:1744320, 62:1855800, 63:1970480, 64:2088360, 65:2209440, 66:2333720, 67:2461200, 68:2591880, 69:2725760, 70:2862840, 71:3003120, 72:3146600, 73:3293280, 74:3443160, 75:3596240, 76:3752520, 77:3912000, 78:4074680, 79:4240560, 80:4409640, 81:4581920, 82:4757400, 83:4936080, 84:5117960, 85:5303040, 86:5491320, 87:5682800, 88:5877480, 89:6075360, 90:6276440, 91:6480720, 92:6688200, 93:6898880, 94:7112760, 95:7329840, 96:7550120, 97:7773600, 98:8000280, 99:8230160, 100:8463240, 101:8699520, 102:8939000, 103:9181680, 104:9427560, 105:9676640, 106:9928920, 107:10184400, 108:10443080, 109:10704960, 110:10970040, 111:11238320, 112:11509800, 113:11784480, 114:12062360, 115:12343440, 116:12627720, 117:12915200, 118:13205880, 119:13499760, 120:13796840, 121:14097120, 122:14400600, 123:14707280, 124:15017160, 125:15330240, 126:15646520, 127:15966000, 128:16288680, 129:16614560, 130:16943640, 131:17275920, 132:17611400, 133:17950080, 134:18291960, 135:18637040, 136:18985320, 137:19336800, 138:19691480, 139:20049360, 140:20410440, 141:20774720, 142:21142200, 143:21512880, 144:21886760, 145:22263840, 146:22644120, 147:23027600, 148:23414280, 149:23804160, 150:24197240, 151:24593520, 152:24993000, 153:25395680, 154:25801560, 155:26210640, 156:26622920, 157:27038400, 158:27457080, 159:27878960, 160:28304040, 161:28732320, 162:29163800, 163:29598480, 164:30036360, 165:30477440, 166:30921720, 167:31369200, 168:31819880, 169:32273760}
total_exp = {1:0, 2:24, 3:72, 4:120, 5:168, 6:216, 7:288, 8:360, 9:432, 10:504, 11:576, 12:648, 13:720, 14:792, 15:864, 16:956, 17:1068, 18:1200, 19:1352, 20:1524, 21:1716, 22:1928, 23:2142, 24:2358, 25:2576, 26:2796, 27:3019, 28:3245, 29:3474, 30:3706, 31:3948, 32:4200, 33:4462, 34:4734, 35:5016, 36:5308, 37:5610, 38:5962, 39:6364, 40:6816, 41:7318, 42:7870, 43:8622, 44:9574, 45:10726, 46:12078, 47:13630, 48:15382, 49:17534, 50:20086, 51:23038, 52:26390, 53:30142, 54:34394, 55:39146, 56:44398, 57:50150, 58:56402, 59:63154, 60:70406, 61:78158, 62:86410, 63:95162, 64:104514, 65:114466, 66:125018, 67:136170, 68:147922, 69:160274, 70:173226, 71:186778, 72:200930, 73:215682, 74:231034, 75:246986, 76:263538, 77:280690, 78:298442, 79:316794, 80:335746, 81:355298, 82:375450, 83:396202, 84:417554, 85:439506, 86:462058, 87:485210, 88:508962, 89:533314, 90:558266, 91:583818, 92:609970, 93:636722, 94:664074, 95:692026, 96:720578, 97:749730, 98:779482, 99:809834, 100:840786, 101:872338, 102:904490, 103:937242, 104:970594, 105:1004546, 106:1039098, 107:1074250, 108:1110002, 109:1146354, 110:1183306, 111:1220858, 112:1259010, 113:1297762, 114:1337114, 115:1377066, 116:1417618, 117:1458770, 118:1500522, 119:1542874, 120:1585826, 121:1629378, 122:1673530, 123:1718282, 124:1763634, 125:1809586, 126:1856138, 127:1903290, 128:1951042, 129:1999394, 130:2048346, 131:2097898, 132:2148050, 133:2198802, 134:2250154, 135:2302106, 136:2354658, 137:2407810, 138:2461562, 139:2515914, 140:2570866, 141:2626418, 142:2682570, 143:2739322, 144:2796674, 145:2854626, 146:2913178, 147:2972330, 148:3032082, 149:3092434, 150:3153386, 151:3214938, 152:3277090, 153:3339842, 154:3403194, 155:3467146, 156:3531698, 157:3596850, 158:3662602, 159:3728954, 160:3795906, 161:3863458, 162:3931610, 163:4000362, 164:4069714, 165:4139666, 166:4210218, 167:4281370, 168:4353122, 169:4425474, 170:4498426}
